In [ ]:
pip install pyspark

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pyspark
  Downloading pyspark-3.4.0.tar.gz (310.8 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 310.8/310.8 MB 3.5 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.9/dist-packages (from pyspark) (0.10.9.7)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.4.0-py2.py3-none-any.whl size=311317145 sha256=62d0a23f5079788617ad977620ebf31ac43d8213cf3d9a1fa76175d1360b6c3e
  Stored in directory: /root/.cache/pip/wheels/9f/34/a4/159aa12d0a510d5ff7c8f0220abbea42e5d81ecf588c4fd884
Successfully built pyspark
Installing collected packages: pyspark
Successfully installed pyspark-3.4.0

In [ ]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("Sorting").getOrCreate()

In [ ]:
#Created Datframe sample_df""
simpleData = [("James","Sales","NY",90000,34,10000), \
    ("Michael","Sales","NY",86000,56,20000), \
    ("Robert","Sales","CA",81000,30,23000), \
    ("Maria","Finance","CA",90000,24,23000), \
    ("Raman","Finance","CA",99000,40,24000), \
    ("Scott","Finance","NY",83000,36,19000), \
    ("Jen","Finance","NY",79000,53,15000), \
    ("Jeff","Marketing","CA",80000,25,18000), \
    ("Kumar","Marketing","NY",91000,50,21000) \
  ]
columns = ["firstname","department","state","salary","age", "bonus"]
sample_df = spark.createDataFrame(simpleData,  columns)
sample_df.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonys|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|    Raman|   Finance|   CA| 99000| 40|24000|
|    Scott|   Finance|   NY| 83000| 36|19000|
|      Jen|   Finance|   NY| 79000| 53|15000|
|     Jeff| Marketing|   CA| 80000| 25|18000|
|    Kumar| Marketing|   NY| 91000| 50|21000|
+---------+----------+-----+------+---+-----+

In [ ]:
#Using SQL ORDER BY ASC interms of firtsname
# register the DataFrame as a temporary view
sample_df.createOrReplaceTempView("temp_view")

# sort the DataFrame by the "firstname" column in ascending order
df_sorted = spark.sql("SELECT * FROM temp_view ORDER BY firstname")

# show the sorted DataFrame
df_sorted.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonys|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|     Jeff| Marketing|   CA| 80000| 25|18000|
|      Jen|   Finance|   NY| 79000| 53|15000|
|    Kumar| Marketing|   NY| 91000| 50|21000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|    Raman|   Finance|   CA| 99000| 40|24000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Scott|   Finance|   NY| 83000| 36|19000|
+---------+----------+-----+------+---+-----+

In [ ]:
#Used orderBy function 
import pyspark.sql.functions as F
df_sorted = sample_df.orderBy(F.asc('firstname'))

# show the sorted DataFrame
df_sorted.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonys|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|     Jeff| Marketing|   CA| 80000| 25|18000|
|      Jen|   Finance|   NY| 79000| 53|15000|
|    Kumar| Marketing|   NY| 91000| 50|21000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|    Raman|   Finance|   CA| 99000| 40|24000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Scott|   Finance|   NY| 83000| 36|19000|
+---------+----------+-----+------+---+-----+

In [ ]:
#Used asc function 
from pyspark.sql.functions import asc

sorted_df = sample_df.orderBy(asc("firstname"))
sorted_df.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonys|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|     Jeff| Marketing|   CA| 80000| 25|18000|
|      Jen|   Finance|   NY| 79000| 53|15000|
|    Kumar| Marketing|   NY| 91000| 50|21000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|    Raman|   Finance|   CA| 99000| 40|24000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Scott|   Finance|   NY| 83000| 36|19000|
+---------+----------+-----+------+---+-----+

In [ ]:
simpleData = [("James","Sales","NY",90000,34,10000), \
    ("Michael","Sales","NY",86000,56,20000), \
    ("Robert","Sales","CA",81000,30,23000), \
    ("Maria","Finance","CA",90000,24,23000) \
  ]
simpleData2 = [("James","Sales","NY",90000,34,10000), \
    ("Maria","Finance","CA",90000,24,23000), \
    ("Jen","Finance","NY",79000,53,15000), \
    ("Jeff","Marketing","CA",80000,25,18000), \
    ("Kumar","Marketing","NY",91000,50,21000) \
  ]
column_12 = ["firstname","department","state","salary","age", "bonus"]
  # create dataset1
dataset1 = spark.createDataFrame(simpleData, column_12)

# create dataset2
dataset2 = spark.createDataFrame(simpleData2, column_12)

# merge dataset1 and dataset2 based on commonKey
merged_dataset = dataset1.join(dataset2, on="firstname", how="outer")

# display the merged dataset
merged_dataset.show()

+---------+----------+-----+------+----+-----+----------+-----+------+----+-----+
|firstname|department|state|salary| age|bonus|department|state|salary| age|bonus|
+---------+----------+-----+------+----+-----+----------+-----+------+----+-----+
|    James|     Sales|   NY| 90000|  34|10000|     Sales|   NY| 90000|  34|10000|
|     Jeff|      null| null|  null|null| null| Marketing|   CA| 80000|  25|18000|
|      Jen|      null| null|  null|null| null|   Finance|   NY| 79000|  53|15000|
|    Kumar|      null| null|  null|null| null| Marketing|   NY| 91000|  50|21000|
|    Maria|   Finance|   CA| 90000|  24|23000|   Finance|   CA| 90000|  24|23000|
|  Michael|     Sales|   NY| 86000|  56|20000|      null| null|  null|null| null|
|   Robert|     Sales|   CA| 81000|  30|23000|      null| null|  null|null| null|
+---------+----------+-----+------+----+-----+----------+-----+------+----+-----+

In [ ]:
merged_dataset = dataset1.union(dataset2)
# display the merged dataset
merged_dataset.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonus|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|    James|     Sales|   NY| 90000| 34|10000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|      Jen|   Finance|   NY| 79000| 53|15000|
|     Jeff| Marketing|   CA| 80000| 25|18000|
|    Kumar| Marketing|   NY| 91000| 50|21000|
+---------+----------+-----+------+---+-----+

In [ ]:
# merge dataset1 and dataset2 without repeating same rows
merged_dataset = dataset1.union(dataset2).dropDuplicates(["firstname"])
merged_dataset.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonus|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|     Jeff| Marketing|   CA| 80000| 25|18000|
|      Jen|   Finance|   NY| 79000| 53|15000|
|    Kumar| Marketing|   NY| 91000| 50|21000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|   Robert|     Sales|   CA| 81000| 30|23000|
+---------+----------+-----+------+---+-----+

In [ ]:
merged_dataset = dataset1.union(dataset2).distinct()
merged_dataset.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonus|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Kumar| Marketing|   NY| 91000| 50|21000|
|      Jen|   Finance|   NY| 79000| 53|15000|
|     Jeff| Marketing|   CA| 80000| 25|18000|
+---------+----------+-----+------+---+-----+

In [ ]:
merged_dataset = dataset1.union(dataset2).dropDuplicates()
merged_dataset.show()

In [ ]:
dataset1.createOrReplaceTempView("table1")
dataset2.createOrReplaceTempView("table2")
# merge df1 and df2 using SQL UNION
merged_df = spark.sql("SELECT * FROM table1 UNION SELECT * FROM table2")

# display the merged dataframe
merged_df.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonus|
+---------+----------+-----+------+---+-----+
|  Michael|     Sales|   NY| 86000| 56|20000|
|    James|     Sales|   NY| 90000| 34|10000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Kumar| Marketing|   NY| 91000| 50|21000|
|      Jen|   Finance|   NY| 79000| 53|15000|
|     Jeff| Marketing|   CA| 80000| 25|18000|
+---------+----------+-----+------+---+-----+

In [ ]:
simpleData1 = [("James","Sales","NY",90000,34,10000), \
    ("Michael","Sales","NY",86000,56,20000), \
    ("Robert","Sales","CA",81000,30,23000), \
    ("Maria","Finance","CA",90000,24,23000) \
]
simpleData2 = [("James","Sales",90000,34,10000), \
    ("Maria","Finance",90000,24,23000), \
    ("Jen","Finance",79000,53,15000), \
    ("Jeff","Marketing",80000,25,18000), \
    ("Kumar","Marketing",91000,50,21000) \
]
column_1 = ["firstname","department","state","salary","age", "bonus"]
column_2 = ["firstname","department","salary","age", "bonus"]

# create dataset1
dataset1 = spark.createDataFrame(simpleData1, column_1)

# create dataset2
dataset2 = spark.createDataFrame(simpleData2, column_2)

In [ ]:
mergedData = dataset1.unionByName(dataset2, allowMissingColumns=True)
mergedData.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonus|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|    James|     Sales| null| 90000| 34|10000|
|    Maria|   Finance| null| 90000| 24|23000|
|      Jen|   Finance| null| 79000| 53|15000|
|     Jeff| Marketing| null| 80000| 25|18000|
|    Kumar| Marketing| null| 91000| 50|21000|
+---------+----------+-----+------+---+-----+

In [ ]:
dataset2 = dataset2.withColumn('state', lit(None))
merge_df = dataset1.union(dataset2)
merge_df.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonus|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|    James|     Sales| null| 90000| 34|10000|
|    Maria|   Finance| null| 90000| 24|23000|
|      Jen|   Finance| null| 79000| 53|15000|
|     Jeff| Marketing| null| 80000| 25|18000|
|    Kumar| Marketing| null| 91000| 50|21000|
+---------+----------+-----+------+---+-----+

In [ ]:
# merge dataset1 and dataset2 on the "id" column'
merged_dataset = dataset1.join(dataset2, ["firstname", "department", "state", "salary", "age", "bonus"  ], how="outer")

# display the merged dataset
merged_dataset.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonus|
+---------+----------+-----+------+---+-----+
|    James|     Sales| null| 90000| 34|10000|
|    Maria|   Finance| null| 90000| 24|23000|
|      Jen|   Finance| null| 79000| 53|15000|
|     Jeff| Marketing| null| 80000| 25|18000|
|    Kumar| Marketing| null| 91000| 50|21000|
|    James|     Sales|   NY| 90000| 34|10000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Maria|   Finance|   CA| 90000| 24|23000|
+---------+----------+-----+------+---+-----+

In [ ]:
#Add missing columns 'state' & 'salary' to df1
from pyspark.sql.functions import lit
for column in [column for column in dataset2.columns if column not in dataset1.columns]:
    dataset1 = dataset1.withColumn(column, lit(None))

#Add missing column 'age' to df2
for column in [column for column in dataset1.columns if column not in dataset2.columns]:
    dataset2 = dataset2.withColumn(column, lit(None))

In [ ]:
#Finally join two dataframe's df1 & df2 by name
merged_df=dataset1.unionByName(dataset2)
merged_df.show()

+---------+----------+-----+------+---+-----+
|firstname|department|state|salary|age|bonus|
+---------+----------+-----+------+---+-----+
|    James|     Sales|   NY| 90000| 34|10000|
|  Michael|     Sales|   NY| 86000| 56|20000|
|   Robert|     Sales|   CA| 81000| 30|23000|
|    Maria|   Finance|   CA| 90000| 24|23000|
|    James|     Sales| null| 90000| 34|10000|
|    Maria|   Finance| null| 90000| 24|23000|
|      Jen|   Finance| null| 79000| 53|15000|
|     Jeff| Marketing| null| 80000| 25|18000|
|    Kumar| Marketing| null| 91000| 50|21000|
+---------+----------+-----+------+---+-----+

In [ ]:
# Join the dataframes on the common column
merged_df = dataset2.join(dataset1.select("firstname", "state"), "firstname", "left")

# Show the merged dataframe
merged_df.show()

+---------+----------+------+---+-----+-----+-----+
|firstname|department|salary|age|bonus|state|state|
+---------+----------+------+---+-----+-----+-----+
|    James|     Sales| 90000| 34|10000| null|   NY|
|    Maria|   Finance| 90000| 24|23000| null|   CA|
|      Jen|   Finance| 79000| 53|15000| null| null|
|    Kumar| Marketing| 91000| 50|21000| null| null|
|     Jeff| Marketing| 80000| 25|18000| null| null|
+---------+----------+------+---+-----+-----+-----+

In [ ]:
# Create DataFrames with different column names
df1 = spark.createDataFrame([[5, 2, 6]], ["col0", "col1", "col2"])
df2 = spark.createDataFrame([[6, 7]], ["col1", "col4"])

# Using allowMissingColumns
df3 = df1.unionByName(df2, allowMissingColumns=True)
df3.printSchema
df3.show()

+----+----+----+----+
|col0|col1|col2|col4|
+----+----+----+----+
|   5|   2|   6|null|
|null|   6|null|   7|
+----+----+----+----+

In [ ]:
#here df1 and df2 has same column with same oredering,df3 have diff ordering from df1 and df2 and df4 hav diff schema
df1 = spark.read.csv("data1.csv", header=True)
df2 = spark.read.csv("data2.csv", header=True)
df3 = spark.read.csv("data3.csv", header=True)
df4 = spark.read.csv("data4.csv", header=True)
df1.show()

+--------+---+--------------------+-------------+
|    Name|Age|          Department|        State|
+--------+---+--------------------+-------------+
|  Olivia| 30|            Services|     Telemark|
|  Archie| 50|Research and Deve...|         null|
|     Ike| 83|               Sales|         null|
| Eulalie|  5|           Marketing|         null|
|  Marina| 25|         Engineering|         null|
|Greggory| 79|               Sales|         null|
|Thatcher|  3|               Sales|Île-de-France|
|  Haroun| 51|  Product Management|         null|
|  Aeriel| 38|               Legal|         null|
|   Shirl| 73|Business Development|         null|
+--------+---+--------------------+-------------+

In [ ]:
df3.show()

+---------+--------------------+---+-------+
|     Name|          Department|Age|  State|
+---------+--------------------+---+-------+
|    Monte|               Sales| 35|   null|
|  Carilyn|     Human Resources| 62|   null|
|    Sylas|            Services| 74|   null|
|Cristiano|             Support|  4|   null|
|    Rabbi|Research and Deve...| 73|  Braga|
|    Herta|            Services| 61|   null|
|   Hermia|               Legal| 53|   null|
|    Conny|           Marketing| 63|Setúbal|
|     Amby|               Legal| 33|   null|
| Henrieta|Business Development| 93|  Porto|
+---------+--------------------+---+-------+

In [ ]:
merged_df1_2 = df1.union(df2)
merged_df1_2.show()

+-----------+---+--------------------+-------------+
|       Name|Age|          Department|        State|
+-----------+---+--------------------+-------------+
|     Olivia| 30|            Services|     Telemark|
|     Archie| 50|Research and Deve...|         null|
|        Ike| 83|               Sales|         null|
|    Eulalie|  5|           Marketing|         null|
|     Marina| 25|         Engineering|         null|
|   Greggory| 79|               Sales|         null|
|   Thatcher|  3|               Sales|Île-de-France|
|     Haroun| 51|  Product Management|         null|
|     Aeriel| 38|               Legal|         null|
|      Shirl| 73|Business Development|         null|
|       Nola| 28|     Human Resources|         null|
|     Marlin|100|               Legal|         null|
|     Dannel| 61|             Support|         null|
|        Pat| 17|             Support|         null|
|      Retha| 64|     Human Resources|         null|
|     Cazzie| 49|Business Development|         null|
|Christoffer| 83|            Services|         null|
|    Nicolai| 60|               Legal|         null|
|      Tildi| 74|            Training|         null|
|    Emerson| 54|         Engineering|         null|
+-----------+---+--------------------+-------------+

In [ ]:
df4.show()

+------+---+--------------------+
|  Name|Age|          Department|
+------+---+--------------------+
|   Lea| 44|             Support|
|Thatch| 35|Business Development|
|Darcie| 38|  Product Management|
|Carmon| 81|               Legal|
| Nikki|  7|         Engineering|
|   Ram| 15|               Legal|
| Datha| 11|               Sales|
|Bobbie| 32|         Engineering|
| Cross| 70|Research and Deve...|
|Goraud| 26|           Marketing|
+------+---+--------------------+

In [ ]:
df1.show()

+--------+----+--------------------+-------------+
|    Name|Age |          Department|        State|
+--------+----+--------------------+-------------+
|  Olivia|  30|            Services|     Telemark|
|  Archie|  50|Research and Deve...|         null|
|     Ike|  83|               Sales|         null|
| Eulalie|   5|           Marketing|         null|
|  Marina|  25|         Engineering|         null|
|Greggory|  79|               Sales|         null|
|Thatcher|   3|               Sales|Île-de-France|
|  Haroun|  51|  Product Management|         null|
|  Aeriel|  38|               Legal|         null|
|   Shirl|  73|Business Development|         null|
+--------+----+--------------------+-------------+

In [ ]:
#Data1 and data 3 have dif data order
merged_df1_3 = df1.unionByName(df3, allowMissingColumns=True)
merged_df1_3.show()

+---------+---+--------------------+-------------+
|     Name|Age|          Department|        State|
+---------+---+--------------------+-------------+
|   Olivia| 30|            Services|     Telemark|
|   Archie| 50|Research and Deve...|         null|
|      Ike| 83|               Sales|         null|
|  Eulalie|  5|           Marketing|         null|
|   Marina| 25|         Engineering|         null|
| Greggory| 79|               Sales|         null|
| Thatcher|  3|               Sales|Île-de-France|
|   Haroun| 51|  Product Management|         null|
|   Aeriel| 38|               Legal|         null|
|    Shirl| 73|Business Development|         null|
|    Monte| 35|               Sales|         null|
|  Carilyn| 62|     Human Resources|         null|
|    Sylas| 74|            Services|         null|
|Cristiano|  4|             Support|         null|
|    Rabbi| 73|Research and Deve...|        Braga|
|    Herta| 61|            Services|         null|
|   Hermia| 53|               Legal|         null|
|    Conny| 63|           Marketing|      Setúbal|
|     Amby| 33|               Legal|         null|
| Henrieta| 93|Business Development|        Porto|
+---------+---+--------------------+-------------+

In [ ]:
#Data4 does not have state
merged_df1_4 = df1.unionByName(df4, allowMissingColumns=True)
merged_df1_4.show()

+--------+---+--------------------+-------------+
|    Name|Age|          Department|        State|
+--------+---+--------------------+-------------+
|  Olivia| 30|            Services|     Telemark|
|  Archie| 50|Research and Deve...|         null|
|     Ike| 83|               Sales|         null|
| Eulalie|  5|           Marketing|         null|
|  Marina| 25|         Engineering|         null|
|Greggory| 79|               Sales|         null|
|Thatcher|  3|               Sales|Île-de-France|
|  Haroun| 51|  Product Management|         null|
|  Aeriel| 38|               Legal|         null|
|   Shirl| 73|Business Development|         null|
|     Lea| 44|             Support|         null|
|  Thatch| 35|Business Development|         null|
|  Darcie| 38|  Product Management|         null|
|  Carmon| 81|               Legal|         null|
|   Nikki|  7|         Engineering|         null|
|     Ram| 15|               Legal|         null|
|   Datha| 11|               Sales|         null|
|  Bobbie| 32|         Engineering|         null|
|   Cross| 70|Research and Deve...|         null|
|  Goraud| 26|           Marketing|         null|
+--------+---+--------------------+-------------+

In [ ]:
dataset4 = df4.withColumn('state', lit(None))
merge_df = df1.union(dataset4)
merge_df.show()

+--------+---+--------------------+-------------+
|    Name|Age|          Department|        State|
+--------+---+--------------------+-------------+
|  Olivia| 30|            Services|     Telemark|
|  Archie| 50|Research and Deve...|         null|
|     Ike| 83|               Sales|         null|
| Eulalie|  5|           Marketing|         null|
|  Marina| 25|         Engineering|         null|
|Greggory| 79|               Sales|         null|
|Thatcher|  3|               Sales|Île-de-France|
|  Haroun| 51|  Product Management|         null|
|  Aeriel| 38|               Legal|         null|
|   Shirl| 73|Business Development|         null|
|     Lea| 44|             Support|         null|
|  Thatch| 35|Business Development|         null|
|  Darcie| 38|  Product Management|         null|
|  Carmon| 81|               Legal|         null|
|   Nikki|  7|         Engineering|         null|
|     Ram| 15|               Legal|         null|
|   Datha| 11|               Sales|         null|
|  Bobbie| 32|         Engineering|         null|
|   Cross| 70|Research and Deve...|         null|
|  Goraud| 26|           Marketing|         null|
+--------+---+--------------------+-------------+

In [ ]:
df1.show()

+--------+---+--------------------+-------------+
|    Name|Age|          Department|        State|
+--------+---+--------------------+-------------+
|  Olivia| 30|            Services|     Telemark|
|  Archie| 50|Research and Deve...|         null|
|     Ike| 83|               Sales|         null|
| Eulalie|  5|           Marketing|         null|
|  Marina| 25|         Engineering|         null|
|Greggory| 79|               Sales|         null|
|Thatcher|  3|               Sales|Île-de-France|
|  Haroun| 51|  Product Management|         null|
|  Aeriel| 38|               Legal|         null|
|   Shirl| 73|Business Development|         null|
+--------+---+--------------------+-------------+

In [ ]:
df1.is_cached

True

In [ ]:
dfPersist = df1.persist()
dfPersist.explain()

== Physical Plan ==
InMemoryTableScan [Name#2485, Age#2486, Department#2487, State#2488]
   +- InMemoryRelation [Name#2485, Age#2486, Department#2487, State#2488], StorageLevel(disk, memory, deserialized, 1 replicas)
         +- FileScan csv [Name#2485,Age#2486,Department#2487,State#2488] Batched: false, DataFilters: [], Format: CSV, Location: InMemoryFileIndex(1 paths)[file:/content/data1.csv], PartitionFilters: [], PushedFilters: [], ReadSchema: struct<Name:string,Age:string,Department:string,State:string>

In [ ]:
from pyspark.storagelevel import StorageLevel
dir(StorageLevel)

['DISK_ONLY',
 'DISK_ONLY_2',
 'DISK_ONLY_3',
 'MEMORY_AND_DISK',
 'MEMORY_AND_DISK_2',
 'MEMORY_AND_DISK_DESER',
 'MEMORY_ONLY',
 'MEMORY_ONLY_2',
 'NONE',
 'OFF_HEAP',
 '__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__']

In [ ]:
dfPersist1 = df1.persist(StorageLevel.MEMORY_AND_DISK)
dfPersist1.is_cached

True

In [ ]:
dfPersist1 = dfPersist1.unpersist()
dfPersist1.is_cached

False

In [ ]:
dfPersist1 = df1.persist(StorageLevel.DISK_ONLY)
dfPersist1.is_cached

True

In [ ]:
from pyspark.sql import SparkSession

spark = SparkSession.builder.appName('UDF example.com').getOrCreate()

columns = ["age","Name"]
data = [("1", "sunee"),
    ("2", "junee"),
    ("3", "sanam")]

df = spark.createDataFrame(data=data,schema=columns)

df.show(truncate=False)

+---+-----+
|age|Name |
+---+-----+
|1  |sunee|
|2  |junee|
|3  |sanam|
+---+-----+

In [ ]:
def convertCase(str):
    resStr=""
    arr = str.split(" ")
    for x in arr:
       resStr= resStr + x[0:1].upper() + x[1:len(x)] + " "
       return resStr

In [ ]:
a = convertCase('abcd uu')

In [ ]:
print(a)

Abcd

In [ ]:
from pyspark.sql.functions import col,udf,StringType
# Converting function to UDF 
convertUDF = udf(lambda z: convertCase(z),StringType())

In [ ]:
df.select(col("age"), \
    convertUDF(col("Name")).alias("Name") ) \
   .show(truncate=False)

+---+------+
|age|Name  |
+---+------+
|1  |Sunee |
|2  |Junee |
|3  |Sanam |
+---+------+

In [ ]:
def convertCase_capitalize(str):
    resStr=""
    arr = str.split(" ")
    for x in arr:
       resStr= resStr + x.capitalize()
       return resStr

In [ ]:
a = convertCase_capitalize('abcd kj')
print(a)

Abcd

In [ ]:
# Converting function to UDF 
convertUDF_capitalize = udf(lambda z: convertCase_capitalize(z),StringType())

In [ ]:
df.select(col("age"), \
    convertUDF_capitalize(col("Name")).alias("Name") ) \
   .show(truncate=False)

+---+-----+
|age|Name |
+---+-----+
|1  |Sunee|
|2  |Junee|
|3  |Sanam|
+---+-----+

In [ ]:
columns = ["Seqno","Name","salary"]

data = [(1, "john jones",200),
    (2, "tracey smith",300),
    (3, "amy sanders",400)]

df = spark.createDataFrame(data=data,schema=columns)

df.show(truncate=False)

+-----+------------+------+
|Seqno|Name        |salary|
+-----+------------+------+
|1    |john jones  |200   |
|2    |tracey smith|300   |
|3    |amy sanders |400   |
+-----+------------+------+

In [ ]:
def fun(one,two):
    return one*two

In [ ]:
from pyspark.sql.types import IntegerType
convertUDF1 = udf(lambda z: fun(z,r),IntegerType())

In [ ]:
from pyspark.sql.functions import udf
from pyspark.sql.types import StringType

convertUDF1 = udf(lambda z,r: fun(z,r),IntegerType())
df.select(convertUDF1(col("Seqno"),col("salary")).alias("data") ) \
   .show(truncate=False)

+----+
|data|
+----+
|200 |
|600 |
|1200|
+----+

In [ ]:
# Import
from pyspark.sql import SparkSession

# Create SparkSession
spark = SparkSession.builder.appName('concat.com') \
                    .getOrCreate()

# Prepare data
data=data = [('junee','stha','1981-04-01'),
  ('sunee','stha','2000-05-19'),
  ('sanam','stha','1978-09-05'),
  ('anam','stha','1967-12-01'),
  ('sujal','stha','1980-02-17')
]

columns=["firstname","lastname","dob"]
df=spark.createDataFrame(data,columns)
df.show(truncate=False)

+---------+--------+----------+
|firstname|lastname|dob       |
+---------+--------+----------+
|junee    |stha    |1981-04-01|
|sunee    |stha    |2000-05-19|
|sanam    |stha    |1978-09-05|
|anam     |stha    |1967-12-01|
|sujal    |stha    |1980-02-17|
+---------+--------+----------+

In [ ]:
# udf function
def merge(x, y, z):
    return x +' '+ y + ' ' 'born in '+ z

concat_cols = udf(merge, StringType())

In [ ]:
# using udf
df.withColumn("Full_Name",concat_cols(df.firstname,df.lastname, df.dob)) \
  .show(truncate=False)

+---------+--------+----------+-----------------------------+
|firstname|lastname|dob       |Full_Name                    |
+---------+--------+----------+-----------------------------+
|junee    |stha    |1981-04-01|junee stha born in 1981-04-01|
|sunee    |stha    |2000-05-19|sunee stha born in 2000-05-19|
|sanam    |stha    |1978-09-05|sanam stha born in 1978-09-05|
|anam     |stha    |1967-12-01|anam stha born in 1967-12-01 |
|sujal    |stha    |1980-02-17|sujal stha born in 1980-02-17|
+---------+--------+----------+-----------------------------+